# CADLinkUniqueId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..CADLinkUniqueId Property
EnergyAnalysisSurface Class See Also
---
The unique id of the originating CAD object's link (linked document) associated with this surface.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string CADLinkUniqueId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CADLinkUniqueId As String
	Get
```

Visual C++
---
```text
public:
property String^ CADLinkUniqueId {
	String^ get ();
}
```

# Remarks
This id can be passed to obtain the element from Document.Element[string] property, but any link obtained through this method may no longer be a valid or up-to-date link. The originating CAD link is only accurate and up-to-date at the time of creation of the energy model. An empty string is returned if the originating CAD object is not hosted in a linked document.
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace